SSD_PATH = '/Volumes/T7/asset/'

# POPULATION SEOUL COLS FOR GETTING DATA
POPSE_GEN_COLS = [
    "구분별", "동별", "항목", "단위",
    "202001", "202002", "202003", "202004", "202005", "202006", "202007", "202008", "202009", "202010", "202011", "202012",
    "202101", "202102", "202103", "202104", "202105", "202106", "202107", "202108", "202109", "202110", "202111", "202112",
    "202201", "202202", "202203", "202204", "202205", "202206", "202207", "202208", "202209", "202210", "202211", "202212",    
    "202301", "202302", "NN"
]

# CBD CODES
SCG_CD = '11650'
GNG_CD = '11680'
GG_CD = '11140'
JNG_CD = '11110'
YDPG_CD = '11560'

SCBD_CDS = [GG_CD, JNG_CD]
GBD_CDS = [SCG_CD, GNG_CD]
YBD_CDS = [YDPG_CD]

CBD_CDS = SCBD_CDS + GBD_CDS + YBD_CDS

# CBD NAMES
SCG_NM = '서초구'
GNG_NM = '강남구'
GG_NM = '중구'
JNG_NM = '종로구'
YDPG_NM = '영등포구'

SCBD_NMS = [GG_NM, JNG_NM]
GBD_NMS = [SCG_NM, GNG_NM]
YBD_NMS = [YDPG_NM]

CBD_NMS = SCBD_NMS + GBD_NMS + YBD_NMS

# MAINPURPOSE CODE
MAINPURPSCD_IN_INTEREST = ['03000', '04000','07000','14000','15000', '17000', '18000', '20000']



# METRO OD DATA DICT AMEND
keys = [
    '04시-05시 승차인원',
    '04시-05시 하차인원',
    '05시-06시 승차인원',
    '05시-06시 하차인원', 
    '06시-07시 승차인원', 
    '06시-07시 하차인원', 
    '07시-08시 승차인원',
    '07시-08시 하차인원', 
    '08시-09시 승차인원', 
    '08시-09시 하차인원',
    '09시-10시 승차인원',
    '09시-10시 하차인원', 
    '10시-11시 승차인원', 
    '10시-11시 하차인원', 
    '11시-12시 승차인원',
    '11시-12시 하차인원', 
    '12시-13시 승차인원', 
    '12시-13시 하차인원', 
    '13시-14시 승차인원',
    '13시-14시 하차인원', 
    '14시-15시 승차인원', 
    '14시-15시 하차인원', 
    '15시-16시 승차인원',
    '15시-16시 하차인원', 
    '16시-17시 승차인원', 
    '16시-17시 하차인원', 
    '17시-18시 승차인원',
    '17시-18시 하차인원', 
    '18시-19시 승차인원', 
    '18시-19시 하차인원', 
    '19시-20시 승차인원',
    '19시-20시 하차인원', 
    '20시-21시 승차인원', 
    '20시-21시 하차인원', 
    '21시-22시 승차인원',
    '21시-22시 하차인원', 
    '22시-23시 승차인원', 
    '22시-23시 하차인원', 
    '23시-24시 승차인원',
    '23시-24시 하차인원', 
    '00시-01시 승차인원', 
    '00시-01시 하차인원', 
    '01시-02시 승차인원',
    '01시-02시 하차인원', 
    '02시-03시 승차인원', 
    '02시-03시 하차인원', 
    '03시-04시 승차인원',
    '03시-04시 하차인원'
]


values = [
    '0405O',
    '0405D',
    '0506O',
    '0506D',
    '0607O',
    '0607D',
    '0708O',
    '0708D',
    '0809O',
    '0809D',
    '0910O',
    '0910D',
    '1011O',
    '1011D',
    '1112O',
    '1112D',
    '1213O',
    '1213D',
    '1314O',
    '1314D',
    '1415O',
    '1415D',
    '1516O',
    '1516D',
    '1617O',
    '1617D',
    '1718O',
    '1718D',
    '1819O',
    '1819D',
    '1920O',
    '1920D',
    '2021O',
    '2021D',
    '2122O',
    '2122D',
    '2223O',
    '2223D',
    '2324O',
    '2324D',
    '0001O',
    '0001D',
    '0102O',
    '0102D',
    '0203O',
    '0203D',
    '0304O',
    '0304D'
]

DF_METRO_COL_AMEND_DICT = {key: value for key, value in zip(keys, values)}


# GRID DF
GRID_DF_COL = ['ADM_SECT_C', 'geometry', 'idx']